Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_260-The_Akasagarbha_Sutra-v1.tmx
Source language: bo
Languages: en

source: ད་དུང་དུ་དབུགས་ཕྲ་མོ་འབྱུང་བ་དང་འཇུག་པར་བྱེད། ད་དུང་དུ་དེའི་ལུས་ལ་ཚེ་དང་། དྲོད་དང་། རྣམ་པར་ཤེས་པ་འཇུག་པར་འགྱུར་བ་དེའི་ཚེ།
en: They will, however, continue to breathe out and breathe in with a subtle breath, and their life force, warmth, and consciousness will still remain in their bodies.

source: དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོ་ཐ་མལ་པར་སྟོན་པར་བྱེད་དེ།
en: At that time, the bodhisattva Ākāśagarbha will show himself to them as an ordinary person.

source: སེམས་ཅན་གང་སྔོན་བྲམ་ཟེ་ལ་གུས་པར་གྱུར་པ་དེ་དག་གི་རྣམ་པར་ཤེས་པ་ལ་ནི་རིགས་ཀྱི་བུ་དེ་བྲམ་ཟེའི་གཟུགས་སུ་སྟོན་ཏོ།
en: To those beings who in the past revered the brahmins, this son of noble family will show himself in the form of a brahmin.

source: དེ་དག་གི་ངན་སོང་དུ་འགྲོ་བའི་སྡིག་པའི་ལམ་ཐམས་ཅད་སྨོན་ལམ་གྱི་དབང་དང་། ལེགས་པར་སྤྱད་པའི་ལས་ཀྱིས་མྱུར་དུ་བྱང་བར་འགྱུར་བ་དང་།
en: All the unwholesome paths that lead to the lower realms will swiftly be purified by the power of aspirations and the activities of excellent conduct.

source: དེ་དག་མྱུར་དུ་བདག་གི་སེམས་ལ་དབང་ཐོབ་པར་འགྱུར་བ་དང་། ཟབ་མོའི་བཟོད་པ་ལ་གནས་པར་འགྱུར་བའི་ཐབས་སྟོན་ཏོ།
en: He also teaches the methods that allow beings to swiftly gain control over their own minds and abide in profound tolerance.

source: །གང་ཡང་སེམས་ཅན་ལུས་ལ་ནད་སྣ་ཚོགས་ཀྱིས་གཟིར་བ་དང་།
en: “If those sentient beings who suffer from various physical diseases,

source: །ཤེས་རབ་ཀྱིས་ནི་སེམས་ཅན་གནས། །དེ་ནི་ཏིང་འཛིན་སྤྱོད་ཡུལ་ལོ།
en: And where, with wisdom, sentient beings are established, That place is the sphere of activity of meditative concentration.

source: གང་ཡང་སེམས་གཡེངས་པ་དང་།
en: whose minds are distracted,

source: གང་དག་གི་མིག་གི་བར་ཆད་བྱས་པ་དང་།
en: who have impaired eyesight,

source: སངས་རྒྱས་ཀྱི་གཟུགས་བསྟན་ནས་འདི་སྐད་ཅེས་སྨྲའོ།
en: he will display the form of the Buddha and utter these words:

source: ལྕེ་བཅིངས་པ་དང་།
en: who are inarticulate,

source: །སངས་རྒྱས་ཡེ་ཤེས་བདེན་པ་ཡིས། །སྲིད་པའི་རྒྱ་མཚོ་གང་སྒྲོལ་བ།
en: “ ‘The truth of the Buddha’s primordial wisdom Frees those dwelling in the ocean of existence.

source: །དེ་ནི་ནམ་མཁའི་སྙིང་པོ་ཡི། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ཏེ།
en: “It is the sphere of activity Of the Bodhisattva Ākāśagarbha,

source: །ཡེ་ཤེས་དེ་ལ་མྱུར་དུ་རེག །སྡུག་བསྔལ་ཀུན་ལས་འགྲོལ་བར་འགྱུར།
en: Swiftly attain that primordial wisdom, And you will be liberated from all suffering.’

source: གང་དག་གི་ཡན་ལག་གང་ཡང་རུང་བ་ཞིག་ཉམས་པར་གྱུར་ན།
en: or who are physically disabled in any way,

source: །སྣང་བ་མེད་ཅིང་སྤྲོས་མེད་པའི། །ཏིང་ངེ་འཛིན་ནི་དེ་ཡིས་བསྟན།
en: Who has demonstrated the meditative concentration free of appearances And free of proliferations.

source: །ལྟ་བ་གཉིས་ལ་གང་ཆགས་པ། །ཕྱི་ཕྱིར་ཞིང་ནི་རྨོངས་པར་འགྱུར།
en: “Whoever is attached to the two views Will later be in a realm of delusion.

source: དྲི་འབུལ། ཨ་ག་རུའི་བདུག་པས་བདུག་པར་བྱེད་ན།
en: and offer perfume and incense of aloe wood.

source: །དེ་བཞིན་དུ་ཆོས་དང་། དགེ་འདུན་ལ་བརྗོད་པར་བྱའོ།
en: The same can be said with respect to the Dharma and the Saṅgha.

source: །དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོ་ནི་ཡོན་ཏན་གྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་ནོ།
en: This shows that the bodhisattva Ākāśagarbha is endowed with inconceivable excellent qualities.

source: འདི་ལྟ་སྟེ།
en: That is to say,

source: ཅི་ནས་ཀྱང་འབྱུང་བ་ཆེན་པོ་རྣམས་ཀྱི་རང་བཞིན་སྐྱེ་ཞིང་འཇིག་པ་ཤེས་པར་བྱས་ནས།
en: they must understand the nature of the great elements to be arising and perishing.

source: །གང་ཡང་ཏིང་ངེ་འཛིན་རྣམ་པ་སྣ་ཚོགས་ལ་སེམས་ཀྱིས་ཤིན་ཏུ་དབང་བྱ་བར་འདོད་ན། དེས་ཐོ་རངས་ཀྱི་ཐུན་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོ་ལ་ཕྱག་འཚལ་ཏེ་མཆོད་པ་ཅི་ནུས་ཀྱིས་བྱའོ།
en: “Those who wish to perfectly master different kinds of meditative concentration should pay homage to the bodhisattva Ākāśagarbha during the watch of dawn and make as many offerings as possible.

source: ཅི་ནས་ཀྱང་རྟག་པ་དང་ཆད་པ་སྤངས་པར་འགྱུར་བ་དང་།
en: “Thus will they definitively abandon eternalism and nihilism,

source: མི་འཇིགས། མི་དངངས། མི་སྐྲག་པར་འགྱུར་བ་དང་།
en: and they will not be at all frightened or terrified.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་ཉེ་བར་གཞག་སྟེ་འདི་སྐད་ཅེས་བརྗོད་དོ།
en: Establishing the mind in loving kindness for all sentient beings, they should then utter these words:

source: རྨི་ལམ་ན་ནད་པའི་མདུན་དུ་འདུག་སྟེ་དེའི་ནད་ཞི་བར་བྱ་བའི་ཕྱིར་སྨན་དང་ཡོ་བྱད་དུ་གྱུར་པ་ཐམས་ཅད་དེ་བཞིན་དུ་སྟོན་ཅིང་ནད་པའི་སྦྱོར་བ་གཅིག་གིས་ནད་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ།
en: In the dreams he will sit before sick people and manifest whatever appropriate medicine and instruments can pacify their illness. And with one treatment he will heal all illness.

source: །ཀྱེ་གྲོགས་པོ་དག་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལས་ཐོག་མ་པ་ལ་དེ་ཉིད་བརྗོད་དུ་ཡོད་པའི་འདུ་ཤེས་ཀྱི་ཚུལ་གྱིས་དམིགས་པ་དང་བཅས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བརྗོད་པར་བྱ་སྟེ།
en: “Listen well, companions: for bodhisattva mahāsattvas who are beginners one must explain the six perfections with a reference point, with the notion that suchness is expressible.

source: །དགོངས་ཤིག་དགོངས་ཤིག །ནམ་མཁའི་སྙིང་པོ་ཐུགས་རྗེ་ཆེན་པོ་བརྙེས་པ།
en: ‘Give heed, give heed to me. Ākāśagarbha, you have achieved great compassion.

source: །དེ་ནི་མྱུར་དུ་ས་འཐོབ་འགྱུར།
en: Thereby swiftly attaining the grounds.

source: བདག་ལ་དྲན་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་རྣལ་འབྱོར་སྩོལ་ཅིག
en: I pray, please bestow upon me mindfulness and the yoga of meditative concentration.

source: གང་ཡོན་ཏན་འདོད་པ་དང་།
en: those who desire good qualities,

source: གང་དབེན་པར་འདོད་པ་དང་།
en: long for solitude,

source: །ལྟ་བ་གཉིས་པོ་འདི་དག་ལས། །རབ་ཏུ་གྲོལ་བར་སུ་འདོད་པ། །བརྗོད་དུ་མེད་པ་བསྒོམ་པར་གྱིས།
en: “Those who wish to free themselves Completely from both of these views Should meditate on that which is inexpressible,

source: །དེ་བཞིན་དུ་གང་ཞལ་ཏ་དང་། ལོངས་སྤྱོད་འདོད་པ་དང་། གང་ཁ་ཏོན་དང་། ཐོས་པར་འདོད་པ་དང་།
en: “Similarly, the son of noble family teaches the appropriate methods to those who desire good advice or possessions, wish to recite prayers and to study,

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་ལ་དེ་ལྟར་རྟོགས་ན་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་འགྱུར་རོ།
en: Bhagavān, a bodhisattva mahāsattva who understands all phenomena in this way attains acceptance that all phenomena are non-arising.

source: །རྟག་དང་ཆད་ལ་ཆགས་པ་ནི། །ཕ་རོལ་ཚུ་རོལ་ཤིན་ཏུ་རྨོངས།
en: Attachment to eternalism and nihilism Is utter delusion about here and there.

source: །འདི་ལྟ་སྟེ། བཅོམ་ལྡན་འདས།
en: Bhagavān, it is thus:

source: ཆོས་ཐམས་ཅད་ལ་ཆགས་པར་དམིགས་པའི་སེམས་སུ་མ་གྱུར་པར་བྱས་ན་དེ་མྱུར་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་ཤིང་།
en: Once they have ceased to relate to phenomena with attachment, they will swiftly perfect the six perfections

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱག་གཡས་པ་བརྐྱང་སྟེ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Thereupon, extending his right arm, the Bhagavān proclaimed:

source: །ནམ་མཁའི་སྙིང་པོ་ཞེས་བྱ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་དང་མཚུངས་པ།
en: “The bodhisattva mahāsattva Ākāśagarbha’s meditative concentration is like an ocean.

source: བྱང་ཆུབ་སེམས་དཔའ་བསླབ་པ་རི་རབ་དང་མཚུངས་པ།
en: This bodhisattva’s training is like Mount Meru,

source: ཡེ་ཤེས་ནམ་མཁའ་དང་མཚུངས་པ།
en: his primordial wisdom like space,

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་མིག་ལས་རྒྱལ་བར་བྱེད་པ་སེང་གེའི་འགྲོས་ཀྱི་ཕྱིར་བསྒྱིངས་པའི་གཟུངས་འདིས་སེམས་ཅན་དག་འཆི་བའི་ཚེ།
en: Son of noble family, when you use this dhāraṇī of the majestic lion turning backwards, which overwhelms everyone who sees him, at the time of death,

source: བརྩོན་འགྲུས་རླུང་དང་མཚུངས་པ།
en: his vigor like wind,

source: བཟོད་པ་རྡོ་རྗེ་དང་མཚུངས་པ།
en: and his tolerance like a vajra.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ནི་རྒྱལ་མཚན་གྱི་མཆོག་ལྟ་བུ་
en: He is like a supreme victory banner among all bodhisattvas.

source: །དྲན་པ་དང་ཏིང་ངེ་འཛིན་གྱི་རྣལ་འབྱོར་བདག་ལ་སྩོལ་ཅིག
en: Pray bestow upon me the yoga of mindfulness and meditative concentration.

source: མྱ་ངན་ལས་འདའ་བའི་གནས་སུ་འགྲོ་བ་རྣམས་ཀྱི་ནི་དེད་དཔོན་ལྟ་བུ།
en: For voyagers to nirvāṇa, he is like a captain.

source: །འདི་སྐད་ཀྱང་བརྗོད་པར་བྱའོ།
en: and speak these words:

source: །སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་སུ་བྱའོ།
en: generate loving kindness for all sentient beings,

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་ནི་གཏེར་ལྟ་བུ།
en: He is like a treasure of all the roots of virtue.

source: །མཆོད་པ་ཅི་ནུས་ཀྱིས་བྱའོ།
en: make as many offerings as possible,

source: དེས་ཁྲུས་བྱས་ཏེ་སྐྱ་རེངས་འབྱུང་བའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོ་ལ་ཕྱག་བྱའོ།
en: should first bathe and then pay homage to the bodhisattva Ākāśagarbha at the break of dawn,

source: སྡུག་བསྔལ་བ་ཐམས་ཅད་ཀྱི་ནི་བུམ་པ་བཟང་པོ་ལྟ་བུ།
en: For all who suffer, he is like a wishing vase;

source: མུན་པར་བཅུག་པ་རྣམས་ཀྱི་ནི་ཉི་མ་ལྟ་བུ།
en: for those engulfed in darkness, like the sun;

source: ལམ་སྟོར་བ་རྣམས་ཀྱི་ནི་ཟླ་བ་ལྟ་བུ།
en: for those who have lost their way, like the moon;

source: འཇིགས་པ་རྣམས་ཀྱི་ནི་རི་རབ་ལྟ་བུ།
en: for the frightened, like Mount Meru;

source: ཉོན་མོངས་པའི་ནད་ཀྱིས་ཡོངས་སུ་གདུངས་པ་རྣམས་ཀྱི་ནི་སྨན་བཅུད་ཀྱིས་ལེན་པ་ལྟ་བུ།
en: for those severely tormented by the sickness of afflictions, like a medicinal elixir;

source: དགེ་བའི་རྩ་བ་ཆད་དེ་ལྷུང་བ་རྣམས་ཀྱི་ནི་འཁར་བ་ལྟ་བུ།
en: for those who have severed the roots of virtue and fallen, like a walking stick.

source: ཕྲེང་བས་འཚོ་བ་རྣམས་ཀྱི་ནི་མེ་ཏོག་ལྟ་བུ།
en: For those who make a living by weaving garlands, he is like a flower;

source: སྡོམ་པ་སྤྱོད་པ་རྣམས་ཀྱི་ནི་མེ་ལོང་ལྟ་བུ།
en: for those who observe vows, like a mirror;

source: ངོ་ཚ་ཤེས་པ་དང་ཁྲེལ་ཡོད་པ་རྣམས་ཀྱི་ནི་གོས་ལྟ་བུ།
en: for those who have conscientiousness and modesty, like clothing;

source: མྱ་ངན་ལས་འདའ་བར་འགྲོ་བ་རྣམས་ཀྱི་ནི་སྟེགས་ལྟ་བུ།
en: for travelers to nirvāṇa, like a footbridge;

source: ཕ་རོལ་དུ་འགྲོ་བ་རྣམས་ཀྱི་ནི་གྲུ་ལྟ་བུ།
en: for voyagers to the other shore, like a boat;

source: མཐོ་རིས་སུ་འགྲོ་བ་རྣམས་ཀྱི་ནི་ཐེམ་སྐས་ལྟ་བུ།
en: for travelers to the higher realms, like a staircase.

source: ཚིག་ངན་པ་དང་སྐུར་པས་གདུངས་པ་རྣམས་ཀྱི་ནི་གདུགས་ལྟ་བུ།
en: For those suffering from insults and slander, he is like a parasol;

source: ཕ་རོལ་གྱི་རྒོལ་བ་རྣམས་ཀྱི་ནི་སེང་གེ་ལྟ་བུ།
en: for those facing opposition, like a lion;

source: ཆར་པ་རྣམས་ཀྱི་ནི་ཆུ་ལྟ་བུ།
en: for the rains, like water;

source: བདུད་ཀྱི་དགྲ་རྣམས་ཀྱི་ནི་གོ་ཆ་ལྟ་བུ།
en: for those fighting against Māra, like armor;

source: བསླབ་པ་འཁྲུལ་པ་རྣམས་ཀྱི་ནི་མིག་འབྱེད་པ་ལྟ་བུ།
en: for those who have mistaken the precepts, like the opening of their eyes;

source: དགེ་བའི་རྩ་བའི་ལོ་ཏོག་ཐམས་ཅད་ཀྱི་ནི་ས་ལྟ་བུ།
en: for all harvests of the roots of virtue, like the earth.

source: ནད་པ་རྣམས་ཀྱི་ནི་སྨན་པ་ལྟ་བུ།
en: For the sick he is like a doctor;

source: གང་རྒྱ་མཚོ་ཆེན་པོར་འཇུག་འདོད་པ་དང་། གང་ཁུང་དུ་འཇུག་འདོད་པ་དང་། གང་བཅུད་དམ་པ་སྤྱོད་པར་འདོད་པར་གྱུར་པ་དང་།
en: “Those who wish to enter the great ocean or caves, or to make use of the sacred essence,

source: གང་བཙོན་རར་བཅུག་པ་དང་། གང་མཛའ་བ་དང་བྲལ་བ་དང་།
en: who have been imprisoned, are separated from friends,

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: When the Bhagavān had spoken these words,

source: དགེ་སློང་དེ་དག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།།
en: the monks, the entire retinue, and the whole world, including gods, humans, asuras, and gandharvas, rejoiced and praised the Bhagavān’s teachings.

source: །སྲོག་ཆགས་ཁྲི་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Tens of thousands of beings attained acceptance that all phenomena are non-arising.

source: །གཞན་དག་ཀྱང་ས་བཅུ་ལ་ཡེ་ཤེས་སྐྱེས་པར་གྱུར་ཏོ།
en: whereas for others the wisdom of the ten grounds arose.

source: བཀྲེས་པ་རྣམས་ཀྱི་ནི་འབྲུ་ལྟ་བུ།
en: for the hungry, like grain;

source: སྐོམ་པ་རྣམས་ཀྱི་ནི་ཆུ་ཤེལ་ལྟ་བུ།
en: for the thirsty, like a water crystal;

source: ངལ་བ་རྣམས་ཀྱི་ནི་མལ་ལྟ་བུ།
en: for the exhausted, like a bed;

source: ཏིང་ངེ་འཛིན་དང་ལྡན་པ་རྣམས་ཀྱི་ནི་མེ་ཤེལ་ལྟ་བུ།
en: for those in meditative concentration, like a fire lens;

source: སྐྱེད་མོས་ཚལ་ན་རྩེ་བ་རྣམས་ཀྱི་ནི་རྫིང་བུ་ལྟ་བུ།
en: for those playing in parks, like a pool;

source: མཆོད་པ་ཅི་ནུས་ཀྱིས་བྱེད་ལ་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་ཀྱིས་གཞོག་ཅིང་འདི་སྐད་དུ་ཡང་སྨྲ་སྟེ།
en: make as many offerings as possible, settle the mind in loving kindness for all sentient beings, and utter these words:

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ལ་བརྩོན་པ་རྣམས་ཀྱི་ནི་ཕྲེང་བ་ལྟ་བུ་དེ་ཚུར་འོང་སྟེ།
en: for those striving toward enlightenment, like a rosary. Thus does he appear.

source: བྱང་ཆུབ་ཀྱི་ལམ་དུ་ཞུགས་པ་རྣམས་ཀྱི་ནི་ཤིང་རྟ་ལྟ་བུ།
en: for those who have entered the path to enlightenment, like a chariot;

source: རིགས་ཀྱི་བུ་དེ་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱི་ནི་འབྲས་བུ་ལྟ་བུ།
en: “This son of noble family is like the fruition of the perfections,

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། རྒྱལ་རིགས་གདོལ་པ་ནས་དགེ་སྦྱོང་གདོལ་པའི་བར་དུ་སྡིག་པའི་ཆོས་ལས་སྤང་བ་དང་། ཐམས་ཅད་དགེ་བའི་ཆོས་ལ་གཞག་པར་ནུས་སོ།
en: You will bring sentient beings to maturity in such a way that all of them, from the lowliest among the kṣatriyas up to the lowliest among the monastics, will be able to abandon the negative dharmas and will abide by the wholesome dharmas.”

source: རིགས་ཀྱི་བུ་དེ་ས་བཅུ་དང་ལྡན་པ་རྣམས་ཀྱི་ནི་ནོར་བུ་ཡིད་བཞིན་ལྟ་བུ།
en: like a wish-fulfilling jewel for those on the tenth ground,

source: རིགས་ཀྱི་བུ་དེ་དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་རྣམས་ཀྱི་ནི་ཤིང་ཡོངས་འདུ་དང་འདྲ་བ།
en: like a wish-fulfilling tree for those who have achieved the meditative concentration of brave progression.

source: གཅོད་པའི་ཕྱིར་ལྟ་བ་ངན་པའི་སྦྱོར་བ་ཐམས་ཅད་ཀྱི་ནི་མཚོན་ལྟ་བུ།
en: For all who are engaged in negative views, he is like a weapon because he severs;

source: འཇོམས་པའི་ཕྱིར་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་ནི་རྡོ་རྗེ་ལྟ་བུ།
en: for those afflicted beings entangled in latent tendencies, he is like a vajra because he overcomes.

source: །།འཕགས་པ་ནམ་མཁའི་སྙིང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: This completes the Noble Mahāyāna Ākāśagarbha Sūtra.

source: བདུད་རྣམས་ཀྱིས་ནི་ཐུབ་པར་དཀའ་བ། ཐབས་དང་ལྡན་པ་རྣམས་ལ་ནི་ཚེས་གྲངས།
en: The demons cannot conquer him. For those of skillful means, he is the measure of time;

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཤཱཀྱ་པྲ་བྷ་དང་། བན་དེ་རཏྣ་རཀྵི་ཏས་ཞུས་ཤིང་བསྒྱུར་ཏེ་གཏན་ལ་ཕབ་པ།།
en: Edited, translated, and established by the Indian abbot Śākyaprabha and the monk Ratnarakṣita.

source: ཡེ་ཤེས་ཀྱི་ནི་འབྱེད་པ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་ནི་གནས།
en: for primordial wisdom, he is discernment. For the entire Buddhadharma, he is the abode;

source: རང་རྒྱལ་བ་རྣམས་ཀྱི་ནི་ཕྲེང་བ་དང་མཚུངས་པ།
en: for pratyekas, like a garland;

source: ཉན་ཐོས་ཐམས་ཅད་ཀྱི་ནི་གོས་དང་མཚུངས་པ།
en: for all śrāvakas, like the robes;

source: ལྷ་རྣམས་ཀྱི་ནི་མིག་ལྟ་བུ།
en: for gods, like an eye;

source: མི་རྣམས་ཀྱི་ནི་ལམ་ལྟ་བུ།
en: for humans, like a path;

source: ཕྱག་འཚལ་བར་བྱེད།
en: pay homage,

source: དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པ་རྣམས་ཀྱི་ནི་སྐྱབས། ཡི་དགས་རྣམས་ཀྱི་ནི་རྟེན། སེམས་ཅན་དམྱལ་བ་པ་རྣམས་ཀྱི་ནི་མགོན།
en: for those born in the animal realm, a shelter; for pretas, a support; for hell beings, a protector.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོའི་མིང་རྗོད་པར་བྱེད།
en: may utter the name of the bodhisattva Ākāśagarbha,

source: །སེམས་ཅན་གང་དག་ལྟ་བ་ངན་པས་སྡུག་བསྔལ་བར་གྱུར་པའི་འཁོར་བའི་འབྲོག་བསླད་ནས་མཐོ་རིས་དང་ཐར་པར་གནས་པའི་ཐབས་མི་ཤེས་པ་དེ་དག་ཀྱང་
en: Even those sentient beings who, suffering in the desolate place of saṃsāra, have become polluted by their negative views, and do not know the means to reach the higher realms and liberation,

source: གང་དམ་དུ་བཅིངས་པ་དང་།
en: are shackled,

source: གང་ཆད་པས་བཅད་པ་དང་།
en: or punished,

source: །ལུས་ཀྱི་དུག་འབྱུང་བ་ཆེན་པོའི་ནད་གསོ་བར་བྱེད་པའོ།
en: and cures the body’s poisons, the diseases derived from the four great elements.

source: གང་གསད་པ་ལ་ཐུག་པ་དང་།
en: or are about to be killed;

source: གང་ནད་ཀྱིས་བཏབ་པ་དང་། ནད་ཀྱིས་འཇིགས་པ་དང་།
en: those who are struck by a disease or who are afraid of diseases;

source: རིགས་ཀྱི་བུ་དེ་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ནི་བློན་པོ་ལྟ་བུ།
en: For all the tathāgata, arhat, perfectly complete buddhas of the three times, this son of noble family is like a minister.

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་མཐོ་རིས་དང་ཐར་པར་སྐྱེ་བར་སྟོན་པའོ།
en: “This son of noble family, the bodhisattva Ākāśagarbha, shows all beings the way to rebirth in the higher realms and to liberation.

source: ཆོས་ཀྱི་གྲོང་ཁྱེར་གྱི་ནི་སྒོ་སྲུངས་ཡིན་ཏེ།
en: He is the gatekeeper of the city of Dharma.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་ཉོན་མོངས་པའི་ནད་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་པའོ།
en: He frees them completely of the disease of mental afflictions,

source: རིགས་ཀྱི་བུ་དེ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་ཀྱི་བར་གྱིས་ནི་བརྒྱན་པ་ཐམས་ཅད་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་དང་ནི་ལྡན།
en: This son of noble family possesses the perfect buddhas’ primordial wisdom complete with all adornments, including the eighteen unique qualities of a buddha.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་གྱི་མཆོག་རྒྱལ་པོ་ལ་འོས་པ་དང་འདྲའོ།
en: He is like the supreme victory banner of all bodhisattvas, suitable for a king.

source: རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་གཤེགས་པ་མ་གཏོགས་པར་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མཆོད་པའི་དམ་པ་ཐམས་ཅད་ཀྱིས་མཆོད་པར་བྱ་བ་ཡིན་གྱིས།
en: This son of noble family is someone whom all sentient beings, with the exception of the tathāgatas, should worship with every supreme offering.

source: །སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་གནས་སོ། །ཐེ་ཚོམ་མེད་དོ། །ཡེ་ཤེས་གཞན་ལ་རག་མ་ལས་པ་ལ་མཁས་སོ།
en: He possesses all the ocean-like qualities of a buddha, has no doubt, and is a wise person who does not need to depend on others’ wisdom.

source: ད་ཁྱེད་འདིར་ལྷགས་པ་ཐམས་ཅད་ཀྱིས་བསུ་བར་གྱིས་ཤིག
en: Therefore, all of you who have gathered here should now welcome him.

source: །རིགས་ཀྱི་བུ་དེ་ནི་ཐབས་ཤེས་པ་ལ་གནས་སོ།
en: “This son of noble family abides in the understanding of skillful means.

source: དེ་ལྟར་ཆོས་ཟབ་མོའི་ཡོན་ཏན་ལ་གནས་སོ།
en: Thus he abides in the qualities of the profound Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོ་གཟུགས་ཐ་མལ་པ་ནས་བུ་མོའི་གཟུགས་ཀྱི་བར་གྱིས་སེམས་ཅན་དེ་དག་གི་མདུན་དུ་འདུག་སྟེ།
en: “Then the bodhisattva Ākāśagarbha will appear in front of them, in various forms including that of a common person and that of a girl,

source: དབུགས་འབྱིན་པར་བྱེད་དོ། །གང་དག་ཅི་ལས་འཇིགས་པ་དེ་དག་དེ་ལས་རབ་ཏུ་ཐར་བར་བྱེད་དོ།
en: and he will bring them relief and free them from whatever fears they may have.

source: །གལ་ཏེ་རིགས་ཀྱི་བུ་དེ་དོན་དམ་པའི་བདེན་པ་མི་སྐྱེ་བའི་བཀོད་པ་སྟོན་དུ་ཟིན་ན་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་རྨོངས་པར་འགྱུར། བསླད་པར་འགྱུར་རོ།
en: If the son of noble family had manifested a display of unborn ultimate reality, the world’s inhabitants, including the gods, would have become confused and defiled.

source: ཏིང་ངེ་འཛིན་གྱི་བཀོད་པ་ཆེན་པོ་ཡང་བསྟན་པ་བཞིན་ནོ།
en: He also showed a great display of meditative concentration.

source: །མཐུ་ཆེན་པོ་བདག་ནི་སྡུག་བསྔལ་གྱིས་ཉམ་ཐག་གོ། །ཤིན་ཏུ་དབུལ་ལོ།
en: Supremely powerful one, I am worn out by suffering. I am destitute.

source: །དེས་དཔལ་དྲི་ཟའི་སྐད་དུ་བརྗོད་པའི་གླུ་དབྱངས་དང་།
en: He manifested melodies sung by the glorious gandharvas;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྐྱོ་བར་བྱས་ནས་དེའི་འོག་ཏུ་སེམས་ཅན་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཀུན་རྫོབ་ཀྱི་བདེན་པས་བསྒྲུབ་པའི་བཀོད་པ་ཆེན་པོ་ཡང་བསྟན།
en: “Ordinary sentient beings, however, became very disheartened, so he then showed a great display, created on the level of relative truth, in order to bring all sentient beings to complete maturity.

source: ནུབ་ཕྱོགས་ནས་འདིར་འོང་ཞིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་དང་ཐུན་མོང་མ་ཡིན་པ། མཐའ་ཡས་པའི་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་ཀྱང་བསྟན
en: but instead came from the western direction to this place and displayed meditative concentration and the supernatural knowledge of the bases of perception of śrāvakas, pratyekabuddhas, and of the extraordinary beings of the boundless infinity of space.

source: ཇི་ལྟར་རིགས་ཀྱི་བུ་དེ་འདི་ཉིད་དུ་མི་སྣང་བར་གྱུར་ནས་
en: The son of noble family did not appear in this way to those beings,

source: རི་དང་། འབྲོག་དང་། རི་སྐམ་དང་། ཕུག་དང་། གྲོག་པོ་དང་། གཡང་ས་དང་། རྩྭ་དང་། རྩིག་པ་དང་། བོང་བ་དང་། གསེག་མ་དང་། དྲི་ང་བ་ལ་སོགས་པ་མེད་ལ་ལག་མཐིལ་ལྟ་བུར་མཉམ་པར་སྤྲུལ་ཏོ།
en: It was free of mountains, high lands, rocky landscapes, caves, ravines, abysses, grasses, walls, soil, thorns, unpleasant odors, and so on, and was smooth like the palm of a hand.

source: བག་ལ་ཉལ་ཤེས་ནས་ཇི་ལྟར་འདི་ན་སེམས་ཅན་ཁ་ཅིག་བཀོད་པ་ཆེན་པོ་འདིའི་ཕྱིར་འོང་ཞིང་ཏིང་ངེ་འཛིན་དང་། བཀོད་པ་ཆེན་པོ་བལྟ་བའི་ཕྱིར་འདོད་ཆགས་དང་བྲལ་བའི་ས་ལ་གནས་པར་འགྱུར་བ་དང་།
en: Indeed, some of the beings came here for the great display. In order to observe meditative concentration and a great display, one must abide on the level of freedom from attachment.

source: ཇི་ལྟར་ད་ལྟར་ངའི་འདུས་པ་ཆེན་པོ་ན་འཁོད་པའི་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་དང་།
en: Hence, he knows the mentalities and latent tendencies of the beings now present in my great assembly.

source: །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདི་ཐམས་ཅད་མ་ལུས་པར་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་ཤིང་།
en: At that very moment, the bodhisattva mahāsattva Ākāśagarbha manifested this buddhafield, the Sahā world, as being made entirely of seven precious materials.

source: ལ་ལར་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་གཟུགས་སུ་སྤྲུལ་པར་བྱེད་དོ།
en: Sometimes he manifests in the form of a buddha in order to ripen sentient beings,

source: །བློ་རྒྱ་མཚོ་ཆེན་པོ་དང་ལྡན་ནོ།
en: He is endowed with a great ocean-like mind.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་དེ་ནི་དེ་ལྟ་བུའི་ཐབས་ཀྱི་ཡོན་ཏན་གྱི་ཆོས་དང་ལྡན་ནོ།
en: “The bodhisattva mahāsattva Ākāśagarbha is endowed with the excellent quality of such skillful means.

source: དེ་དག་ལ་དེ་ལྟར་ཐབས་ཀྱང་སྟོན་ཏོ།
en: He will also teach them such skillful means.

source: གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་བསེ་རུ་ལྟ་བུའི་རང་སངས་རྒྱས་སུ་གྱུར་ཀྱང་
en: Even if all sentient beings had become pratyekabuddhas, who dwell alone like the rhinoceros,

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོས་ལྷའི་རྣ་བའི་ཁམས་རྣམ་པར་དག་པ། མིའི་ལས་འདས་པས་སྒྲ་དེ་ཐོས་ནས་སེམས་ཅན་དེ་དག་ལ་བདག་ཅི་རིགས་པར་སྟོན་ཏེ།
en: the bodhisattva Ākāśagarbha will hear this with the purified faculty of divine hearing which is beyond human capacity and show himself to those beings in whatever form is appropriate.

source: འཁོར་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། ཉན་ཐོས་ཆེན་པོ་དང་། ལྷའི་དབང་པོ་དང་།
en: that assembly were bodhisattva mahāsattvas and śrāvakas, the lord of devas,

source: བྲམ་ཟེའི་གནས་ཆེན་པོ་དང་། ཁྱིམ་བདག་གི་གནས་ཆེན་པོ་དང་། བཟོའི་གནས་ཆེན་པོ་དང་། ཐོས་པའི་གནས་ཆེན་པོ་དང་། སྒོམ་པའི་གནས་ཆེན་པོ་དང་། གང་མོས་པའི་གནས་ཆེན་པོའི་བར་དུ་འདོད་པ་དེ་དག་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོའི་མིང་ཐོས་ནས་ཕྱག་འཚལ་བར་བྱེད།
en: Having heard the name of the bodhisattva Ākāśagarbha, those who wish to be promoted to a high rank among the brahmins, householders, craftsmen, those engaged in studies, or meditators, up to whatever high rank they aspire to, should pay homage to him.

source: ཀླུའི་དབང་པོ་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་དང་། དྲི་ཟའི་དབང་པོ་དང་།
en: the lord of nāgas, the lord of yakṣas, the lord of gandharvas,

source: ཁྲུས་བྱས་ཏེ་གོས་གཙང་མ་བགོས་ནས་ཐོ་རངས་ཀྱི་ཐུན་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོ་ལ་སྐྱབས་སུ་སོང་ནས་གསོལ་བ་གདབ་པ་འདི་སྐད་དུ་རྗོད་པར་བྱེད་དེ།
en: Once they have bathed and put on clean clothes, they should take refuge in the bodhisattva Ākāśagarbha during the watch of dawn and pray to him, uttering these words:

source: དེ་དག་གིས་ལན་ཅིག་ཕྱིར་འོང་བ་གཅིག་གི་སྤྱོད་ཡུལ་དང་། སྦྱོར་བ་དང་། རྣམ་པར་གྲོལ་བ་མི་ཤེས་སོ།
en: Even then, not one of them would understand the field of experience, practice, or liberation of a single once-returner.

source: ནམ་མཁའི་སྙིང་པོ་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་བདག་ལ་སྐལ་བ་སྩོལ་ཅིག
en: ‘O Ākāśagarbha, your compassion is great indeed! I pray, please bestow good fortune upon me.

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་དང་། ནམ་མཁའ་ལྡིང་གི་དབང་པོ་དང་། མི་འམ་ཅིའི་དབང་པོ་དང་།
en: the lord of asuras, the lord of garuḍas, the lord of kiṃnaras,
